## Converting Time Series problem to Supervised learning Problem

### 1. Pandas *shift()* function

In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame()
df['t'] = [i for i in range(10)]

In [4]:
df

   t
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

We can shift all the obversations one step down by introducing an empty row at top. The *shift()* function does exactly that

In [5]:
df['t-1'] = df['t'].shift(1)

In [6]:
df

   t  t-1
0  0  NaN
1  1  0.0
2  2  1.0
3  3  2.0
4  4  3.0
5  5  4.0
6  6  5.0
7  7  6.0
8  8  7.0
9  9  8.0

It's easy to see that if we shift by 2, 3 or more values, we can create long input sequences (X) which can predict output value (y)

In [7]:
df['t+1'] = df['t'].shift(-1)

In [8]:
df

   t  t-1  t+1
0  0  NaN  1.0
1  1  0.0  2.0
2  2  1.0  3.0
3  3  2.0  4.0
4  4  3.0  5.0
5  5  4.0  6.0
6  6  5.0  7.0
7  7  6.0  8.0
8  8  7.0  9.0
9  9  8.0  NaN

In [ ]:
def series_to_supervised(data, n_in = 1, n_out = 1, dropnan = True):
    n_cols = 1 if type(data) is list else data.shape[1]
    #inputs, t-n_in,.....t-1
    cols, names = list(),list()
    for i range(n_in,0,-1):
        cols.append(df.shift(i))
        names = []

In [9]:
df.shape

(10, 3)

In [11]:
df

   t  t-1  t+1
0  0  NaN  1.0
1  1  0.0  2.0
2  2  1.0  3.0
3  3  2.0  4.0
4  4  3.0  5.0
5  5  4.0  6.0
6  6  5.0  7.0
7  7  6.0  8.0
8  8  7.0  9.0
9  9  8.0  NaN